package io.github.cuilan.tom.constants;

/**
 * 正则表达式规则
 *
 * @author zhangyan
 * @since 2021/12/14
 */
public class RegexConst {

    /**
     * 手机号正则表达式
     * 支持：
     * 13*
     * 145，147，149
     * 150-153，155-159
     * 165，166
     * 170-178
     * 18*
     * 191，195，198，199
     */
    public static final String PHONE_REGEX = "^((13[0-9])|(14[5,7,9])|(15([0-3]|[5-9]))|(16[5,6])|(17[0-8])|(18[0-9])|(19[1、5、8、9]))\\d{8}$";

    /**
     * UTC时间字符串匹配：20220607152800（长度14）
     */
    public static final String TIME_PATTERN_14 = "\\d{4}(0[1-9]|1[0-2])(0[1-9]|[1-2][0-9]|3[0-1])(20|21|22|23|[0-1]\\d)([0-5]\\d){2}";

    /**
     * UTC时间字符串匹配：202206071528（长度12）
     */
    public static final String TIME_PATTERN_12 = "\\d{4}(0[1-9]|1[0-2])(0[1-9]|[1-2][0-9]|3[0-1])(20|21|22|23|[0-1]\\d)([0-5]\\d)";

    /**
     * 时间字符串匹配：2022-06-24 11:44:00
     */
    public static final String TIME_FORMAT = "\\d{4}-(0[1-9]|1[0-2])-(0[1-9]|[1-2][0-9]|3[0-1]) (20|21|22|23|[0-1]\\d):([0-5]\\d):([0-5]\\d)";

}
